---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LinePen
source: html/22a5bae1-ea88-c7ed-43b8-5f5b63e67e93.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LinePen Property

"Line Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId LinePen { get; }
```